package com.example.easyfill_project.texttospeech
//those are the constants of the
object TtsTexts {

    const val HOME =
        "ברוכים הבאים למסך הבית.\n" +
                "כאן תבחרו האם ברצונכם להתחיל בתהליך מיצוי הזכויות,\n" +
                "או צפייה ומעקב אחר ההתקדמות שלכם." +
                "בצד ימין למעלה תוכלו ללחוץ כדי לגשת לתפריט האפליקציה."
    const val PROFILE =
        "זהו מסך ניהולחשבונכם האישי. כאן תוכלו לצפות בפרטים השמורים עבוריכם, תוכלו לעדכן שם, אימייל וסיסמה, ובמידה ותרצו גם להתנתק מחשבונכם האישי ולמחוק אותו ."

    const val SETTINGS =
        "זהו מסך התאמה אישית. ניתן לשנות ניגודיות, גודל טקסט וצלילי רקע."
}