package com.example.easyfill_project.texttospeech
//those are the constants of the
object TtsTexts {

    const val HOME =
        "ברוכים הבאים למסך הבית.\n" +
                "כאן תבחרו האם ברצונכם להתחיל בתהליך מיצוי הזכויות," +
                "\n,או צפייה ומעקב אחר ההתקדמות שלכם." +
                "בצד ימין למעלה תוכלו ללחוץ כדי לגשת לתפריט האפליקציה."
    const val PROFILE =
        "בדף זה תוכלו לנהל את חשבונכם האישי\n כאן תוכלו לצפות בפרטים השמורים עבוריכם, תוכלו לעדכן שם, אימייל וסיסמה. ובמידה ותרצו גם להתנתק מחשבונכם האישי ולמחוק אותו."

    const val PERSONAL_SETTINGS =
        "הגעתם לדף ההתאמה האישית\n כאן תוכלו לבחור בצבע אחר, גודל טקסט שונה, וצלילי רקע."

    //inside the personal settings:
    const val FONT_SIZE = ".כאן תוכלו לבחור גודל טקסט מתאים עבורכם"

    const val SOUND = ".כאן תוכלו לבחור מוזיקת רקע"

    const val CONTRAST = ".כאן תוכלו לבחור לשנות לצבע מתאים עבורכם"

    const val GUIDANCE =
        "הגעתם למדריך האפליקציה\n כאן תוכלו למצוא שאלות ותשובות שיעזרו לכם בתהליך"

    const val UPLOAD_PDF =
        "במסך זה ניתן להעלות קובץ PDF.\n" +
                "המערכת תסרוק את הקובץ ותזהה את השדות שבתוכו.\n" +
                "לאחר מכן נוכל לעזור לכם למלא את הטופס הרצוי בצורה אוטומטית.\n" +
                "באפשרותכם לבחור קובץ, או לדלג אם אין ברשותכם קובץ.\n"


    const val FORM_OPTIONS =
        "כאן תוכלו לבחור את הטופס הרלוונטי, שברצונכם למלא, ולאחר מכן תעברו למילוי הטופס"
}